/*


"use strict"; // Строгий режим



alert ('Hello, world!'); // Вивід повідомлення



let Vlad; // Задання змінної
Vlad = 'Nasadyk'; // Збереження змінної
alert(Vlad); // Вивід змінної



let Olya = 'Dyak'; // Спрощення двох дій з змінними



const myBirthday = '06.09.2020'; // Створення константи



let vlad = 18;
vlad++; // Інкремент/Декремент
alert(vlad); 



result = prompt ('Скільки тобі років?'); // Прийом інформації від користувача (prompt)
alert (`Мені ${result} років!`);



let voss = confirm("Ви тут головні?"); // Підтвердження питання. Якшо нажато ОК, тоді True.
alert (voss);



let year = prompt ("В якому році з'явився КоронаВірус?", ""); // Правльний блок if/else
if (year == 2020) {
    alert ('Та ви знаток!');
} else {
    alert ('А, от і неправильно!');
}  



let year = prompt ("В якому році з'явився КоронаВірус?", ""); // Вказано, декілька умов if/else if/else
if (year < 2020) {
    alert ('Зарано ще!');
} else if (year > 2020) {
    alert ('А, вже запізно');
} else {
    alert ('Та, ви знаток!');
}





let login = prompt("Кто вы?", ""); // Правильне використання контрукцій "?"
let message = (login == "Сотрудник") ? 'Привет':
    (login == "Директор") ? 'Здравствуйте': 
    (login == "") ? 'Нет логина' :
    '';
alert(message);





let book = { // Задання об'єкту
	topic: "JavaScript",
	fat: true
};
book.topic; // Отримання даних із об'єкту
book["fat"] // Другий спосіб отримання значення властивості
book.author = "Flanagan"; // Створити нову властивість привоєнням
book.contents = {}; // { } - Пустий об'єкт без власивості







let primes = [2, 3, 6]; // Задання масиву
primes[0]; // Перший елемент масиву
primes.length; // Довжиеа масиву
primes[primes.length-1]; // Останній елемент
primes[3] = 9; // Добавити новий елемент в масив
primes[3] = 11;







let points = [  // Масив, який містить 2 елементи, кожний елемент - це ОБ'ЄКТ!
	{x:0, y:0},
	{x:1, Y:1}
];






let data = {   // Об'єкт з 2 властивостями, значення з кожної властивості - це МАСИВ, елементи масива являються МАСИВАМИ!
	trial1: [[1,2], [3,4]],
	trial2: [[2,3], [4,5]]
};


3+2 // Додавання
3-2 // Віднімання
3*2 // Множення
3/2 // Ділення
"3" + "2" // + складає числа та об'єднує строки





count++ // Збільшує значення змінної на 1
count-- // Зменшує значення зміноої на 1
count += 2; // Добавити 2, те ж, що count = count  + 2
count *= 3; // Помножити на 3, те ж, що count = count * 3;




x == y // рівність
x != y // нерівність
x < y // менше
x <= y // менше або рівне
x > y // більше 
x => y // більше або рівне
"two" == "three" // дві різні строки
"two" > "three" // tw більше за th
false (x > y) // false = false

(x == 2) && (y == 3) // TRUE: && - AND
(x > 3) || ( y < 3) // FALSE: || - OR
!(x == y) // TRUE: ! - NO

*/

