/*


"use strict"; // Строгий режим



alert ('Hello, world!'); // Вивід повідомлення



let Vlad; // Задання змінної
Vlad = 'Nasadyk'; // Збереження змінної
alert(Vlad); // Вивід змінної



let Olya = 'Dyak'; // Спрощення двох дій з змінними



const myBirthday = '06.09.2020'; // Створення константи



let vlad = 18;
vlad++; // Інкремент/Декремент
alert(vlad); 



result = prompt ('Скільки тобі років?'); // Прийом інформації від користувача (prompt)
alert (`Мені ${result} років!`);



let voss = confirm("Ви тут головні?"); // Підтвердження питання. Якшо нажато ОК, тоді True.
alert (voss);



let year = prompt ("В якому році з'явився КоронаВірус?", ""); // Правльний блок if/else
if (year == 2020) {
    alert ('Та ви знаток!');
} else {
    alert ('А, от і неправильно!');
}  



let year = prompt ("В якому році з'явився КоронаВірус?", ""); // Вказано, декілька умов if/else if/else
if (year < 2020) {
    alert ('Зарано ще!');
} else if (year > 2020) {
    alert ('А, вже запізно');
} else {
    alert ('Та, ви знаток!');
}




let login = prompt("Кто вы?", ""); // Правильне використання контрукцій "?"
let message = (login == "Сотрудник") ? 'Привет':
    (login == "Директор") ? 'Здравствуйте': 
    (login == "") ? 'Нет логина' :
    '';
alert(message);

*/